requests/refreshData.xml

<?xml version="1.0" encoding="UTF-8" ?>
<soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.e-controlnet.de/services/vii/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <RefreshData>
            <DatenpunktIds>
                <int>
                    <![CDATA[11274]]>
                </int>
                <int>
                    <![CDATA[11267]]>
                </int>
                <int>
                    <![CDATA[11269]]>
                </int>
                <int>
                    <![CDATA[5373]]>
                </int>
                <int>
                    <![CDATA[5272]]>
                </int>
                <int>
                    <![CDATA[5381]]>
                </int>
                <int>
                    <![CDATA[5276]]>
                </int>
                <int>
                    <![CDATA[5279]]>
                </int>
                <int>
                    <![CDATA[7895]]>
                </int>
                <int>
                    <![CDATA[10740]]>
                </int>
                <int>
                    <![CDATA[10744]]>
                </int>
                <int>
                    <![CDATA[5372]]>
                </int>
                <int>
                    <![CDATA[5374]]>
                </int>
                <int>
                    <![CDATA[314]]>
                </int>
            </DatenpunktIds>
            <AnlageId>
                <![CDATA[{anlageId}]]>
            </AnlageId>
            <GeraetId>
                <![CDATA[{geraetId}]]>
            </GeraetId>
        </RefreshData>
    </soap:Body>
</soap:Envelope>
